ka2_2024/src/InformationRegisters/СтатусыПроверкиДокументов/СтатусыПроверкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПроверкиДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусПроверки</name>
    <type>
      <types>EnumRef.СтатусыПроверкиФинансовыхДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Проверил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ЗаписьКнигиПокупок</types>
      <types>DocumentRef.ПеремещениеВЭксплуатации</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.РезервыПоОплатеТруда</types>
      <types>DocumentRef.ПоступлениеУслугВПодразделение</types>
      <types>DocumentRef.ПеремещениеМатериаловВПроизводстве</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПереоценкаНМА2_4</types>
      <types>DocumentRef.ПередачаОСВАренду</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.СчетФактураПолученныйАванс</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ПоступлениеУслугПоАренде</types>
      <types>DocumentRef.ИнойДокументПодтвержденияНДС</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.НачислениеРеверсивногоНДС</types>
      <types>DocumentRef.ВводОстатковВзаиморасчетовПоАренде</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА2_4</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.ВнесениеДенежныхСредствВКассуККМ</types>
      <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеОС2_4</types>
      <types>DocumentRef.ОтгрузкаТоваровСХранения</types>
      <types>DocumentRef.ИзменениеПараметровОС2_4</types>
      <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</types>
      <types>DocumentRef.ВозвратОСИзАренды2_4</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.ОбесценениеВНА</types>
      <types>DocumentRef.АктВыполненныхВнутреннихРабот</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ОбъединениеОС</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.СчетФактураВыданныйАванс</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ПеремещениеОС2_4</types>
      <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
      <types>DocumentRef.РазукомплектацияОС</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.МодернизацияОС2_4</types>
      <types>DocumentRef.СписаниеНДСНаРасходы</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>DocumentRef.ПоступлениеТоваровОтХранителя</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПодготовкаКПередачеОС2_4</types>
      <types>DocumentRef.ИзменениеУсловийДоговораАренды</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ПереоценкаОС2_4</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.Сторно</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
      <types>DocumentRef.ПересортицаТоваровУХранителя</types>
      <types>DocumentRef.ПоступлениеАрендованныхОС</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
      <types>DocumentRef.ПереоценкаНМА</types>
      <types>DocumentRef.ПередачаСырьяПереработчику</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.КорректировкаНазначенияТоваров</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.УлучшениеНМА</types>
      <types>DocumentRef.ПодтверждениеЗачисленияЗарплаты</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.ПерерасчетИмущественныхНалогов</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.НачислениеДивидендов</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.ПереоценкаОС</types>
      <types>DocumentRef.ПеремещениеНМА2_4</types>
      <types>DocumentRef.КорректировкаРасчетовПоНалогам</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АннулированиеПодарочныхСертификатов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.СписаниеНМА2_4</types>
      <types>DocumentRef.РаспределениеВозвратныхОтходов</types>
      <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
      <types>DocumentRef.ПринятиеКУчетуОС2_4</types>
      <types>DocumentRef.ИзменениеПараметровОС</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииОС</types>
      <types>DocumentRef.ОтчетОРозничныхВозвратах</types>
      <types>DocumentRef.ВозвратСырьяОтПереработчика</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ОприходованиеТМЦВЭксплуатации</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриемкаТоваровНаХранение</types>
      <types>DocumentRef.ОтчетОСписанииТоваровУХранителя</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.НачислениеПроцентовПоАренде</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ПринятиеКУчетуУзловКомпонентовАмортизации</types>
      <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
      <types>DocumentRef.ВыкупАрендованныхОС</types>
      <types>DocumentRef.НачислениеСписаниеРезервовПредстоящихРасходов</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
      <types>DocumentRef.ВозвратОСИзАренды</types>
      <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
      <types>DocumentRef.СписаниеИзЭксплуатации</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ДепонированиеЗарплаты</types>
      <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииНМА</types>
      <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
      <types>DocumentRef.ЗаписьКнигиПродаж</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.ПризнаниеРасходовПоИсследованиямИРазработкам</types>
      <types>DocumentRef.ВозвратПодарочныхСертификатов</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВыкупТоваровХранителем</types>
      <types>DocumentRef.КорректировкаВидаДеятельностиНДС</types>
      <types>DocumentRef.ПередачаОСВАренду2_4</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
      <types>DocumentRef.ПрекращениеДоговораАренды</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваровУХранителя</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
      <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
      <types>DocumentRef.СписаниеНМА</types>
      <types>DocumentRef.ВыбытиеАрендованныхОС</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
      <types>DocumentRef.ЗаключениеДоговораАренды</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете2_5</types>
      <types>DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</types>
      <types>DocumentRef.РаспределениеНДС</types>
      <types>DocumentRef.ОтчетКомитентуОЗакупках</types>
      <types>DocumentRef.ПорчаТоваровУХранителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/Enums/СтатусыПроверкиФинансовыхДокументов/СтатусыПроверкиФинансовыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроверкиФинансовыхДокументов</name>
  <enumValues>
    <name>НеПроверен</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
  <enumValues>
    <name>КПовторнойПроверке</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/InformationRegisters/СтатусыПроверкиДокументов/Forms/ЖурналДокументов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	НавигационнаяСсылка = "e1cib/app/" + ЭтотОбъект.ИмяФормы;
	
	Элементы.ГруппаКомандПроверкаДокументов.Видимость = ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.СтатусыПроверкиДокументов);
	
	ОбновитьОтборПоТипуДокумента();
	
	РазрешатьИзменятьПроверенныеФинансовыеДокументы = ПолучитьФункциональнуюОпцию("РазрешатьИзменятьПроверенныеФинансовыеДокументы");
	
	Если Параметры.Свойство("ДатаОкончанияПериода") И Не Параметры.ДатаОкончанияПериода = '39991231' Тогда
		Период.ДатаОкончания = Параметры.ДатаОкончанияПериода;
		УстановитьОтборПоПериоду(Список, Период);
	КонецЕсли;
	
	Параметры.Отбор.Свойство("Организация", Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Организация", 
		Организация, 
		,
		,
		ЗначениеЗаполнено(Организация));
	
	Параметры.Отбор.Свойство("СтатусПроверки", СтатусПроверки);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"СтатусПроверки",
		СтатусПроверки,
		,
		, 
		ЗначениеЗаполнено(СтатусПроверки));
	
	Элементы.Организация.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если СтрНайти(ИмяСобытия, "Запись_") > 0 Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		Оповестить("ЗакрытаФормаСпискаДокументов");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", Организация, , , ЗначениеЗаполнено(Организация));
	ПодключитьОбработчикОжидания("НастроитьДоступностьКнопокСписка", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтатусПроверкиОтборПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"СтатусПроверки",
		СтатусПроверки,
		,
		, 
		ЗначениеЗаполнено(СтатусПроверки));
	
	ПодключитьОбработчикОжидания("НастроитьДоступностьКнопокСписка", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	ПоказатьЗначение(Неопределено, СтрокаСписка.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("НастроитьДоступностьКнопокСписка", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьПроверку(Команда)
	
	МассивДокументов = Новый Массив;
	Для каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		Данные = Элементы.Список.ДанныеСтроки(СтрокаСписка);
		МассивДокументов.Добавить(Данные.Документ);
	КонецЦикла;
	
	СообщениеОбОшибках = УстановитьСтатусПроверкиНаСервереИВернутьОшибки(МассивДокументов, Ложь);
	
	Если МассивДокументов.Количество() > 0 Тогда
		Оповестить("Запись_СтатусПроверкиДокумента", МассивДокументов, ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибках) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибках);
	КонецЕсли;
	НастроитьДоступностьКнопокСписка();
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	МассивДокументов = Новый Массив;
	Для каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		Данные = Элементы.Список.ДанныеСтроки(СтрокаСписка);
		МассивДокументов.Добавить(Данные.Документ);
	КонецЦикла;
	
	СообщениеОбОшибках = УстановитьСтатусПроверкиНаСервереИВернутьОшибки(МассивДокументов, Истина);
	
	Если МассивДокументов.Количество() > 0 Тогда
		Оповестить("Запись_СтатусПроверкиДокумента", МассивДокументов, ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибках) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибках);
	КонецЕсли;
	НастроитьДоступностьКнопокСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиМеждународногоУчета(Команда)
	
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиРеглУчета(Команда)
	
	//++ Локализация
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ТекущаяСтрока.Документ;
	
	Отбор = Новый Структура("Регистратор", Документ);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Обработка.ОтражениеДокументовВРеглУчете.Форма.ПроводкиРегламентированногоУчета",
		ПараметрыФормы,
		Команда,
		Документ);
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	
	ОбщегоНазначенияУТКлиент.РедактироватьПериод(Период, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранноеЗначение;
	УстановитьОтборПоПериоду(Список, Период);
	ПодключитьОбработчикОжидания("НастроитьДоступностьКнопокСписка", 0.2, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СтатусПроверки.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СтатусПроверки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не проверяется>'"));
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Номер.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Номер");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<отсутствует>'"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПериоду(Список, Период)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "НачалоПериода", Период.ДатаНачала, ЗначениеЗаполнено(Период.ДатаНачала)); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "КонецПериода", Период.ДатаОкончания, ЗначениеЗаполнено(Период.ДатаОкончания)); 
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьСтатусПроверкиНаСервереИВернутьОшибки(МассивДокументов, СтатусПроверки)
	
	СтрокаОшибок = "";
	ДанныеОбОшибках = Новый Соответствие;
	
	РегистрыСведений.СтатусыПроверкиДокументов.УстановитьСтатусПроверкиДокументов(МассивДокументов, ДанныеОбОшибках, СтатусПроверки);
	
	Если ДанныеОбОшибках.Количество() Тогда
		
		Для каждого Ошибка Из ДанныеОбОшибках Цикл
			СтрокаОшибок = СтрокаОшибок + Ошибка.Значение + ";" + Символы.ПС;
			ИндексОшибочногоДокументаВМассиве = МассивДокументов.Найти(Ошибка.Ключ);
			Если Не ИндексОшибочногоДокументаВМассиве = Неопределено Тогда
				МассивДокументов.Удалить(ИндексОшибочногоДокументаВМассиве);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтрокаОшибок;
	
КонецФункции

&НаКлиенте
Процедура ИнформационнаяНадписьОтборОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОбновитьОтбор" Тогда
		
		ОбновитьОтборПоТипуДокумента();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "НастроитьОтбор" Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ДоступныеХозяйственныеОперацииИДокументы", ПоместитьВоВременноеХранилищеХозяйственныеОперацииИДокументы());
		ПараметрыФормы.Вставить("КлючНастроек", КлючНазначенияИспользования);
		ПараметрыФормы.Вставить("ТолькоПоТипамДокументов", Истина);
		ПараметрыФормы.Вставить("КлючФормы", КлючНазначенияФормыПоУмолчанию());
		
		ОткрытьФорму("Справочник.НастройкиХозяйственныхОпераций.Форма.ФормаУстановкиОтбора",
			ПараметрыФормы,,,,,
			Новый ОписаниеОповещения("УстановитьОтборыПоХозОперациямИДокументам", 
			ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыПоХозОперациямИДокументам(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		
		АдресДоступныхХозяйственныхОперацийИДокументов = ВыбранноеЗначение;
		
		ОтборОперацияТипОбработкаВыбораСервер(АдресДоступныхХозяйственныхОперацийИДокументов);
		ПодключитьОбработчикОжиданияГиперссылкиКОформлению();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияГиперссылкиКОформлению()
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьКнопокСписка()
	
	ПроверитьДоступность = Ложь;
	ОтменитьПроверкуДоступность = Ложь;
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.Список.ДанныеСтроки(СтрокаСписка);
			Если ДанныеСтроки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтатусПроверкиВСтроке = ДанныеСтроки.СтатусПроверки;
			Если Не ПроверитьДоступность Тогда
				ПроверитьДоступность = 
					НЕ СтатусПроверкиВСтроке = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиФинансовыхДокументов.Проверен")
					И НЕ СтатусПроверкиВСтроке = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиФинансовыхДокументов.ПустаяСсылка");
			КонецЕсли;
			Если Не ОтменитьПроверкуДоступность Тогда
				ОтменитьПроверкуДоступность = 
					НЕ СтатусПроверкиВСтроке = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиФинансовыхДокументов.КПовторнойПроверке")
					И НЕ СтатусПроверкиВСтроке = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиФинансовыхДокументов.НеПроверен")
					И НЕ СтатусПроверкиВСтроке = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиФинансовыхДокументов.ПустаяСсылка");
			КонецЕсли;
			
			Если ПроверитьДоступность
				И ОтменитьПроверкуДоступность Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.СписокПроверить.Доступность = ПроверитьДоступность;
	Элементы.СписокОтменитьПроверку.Доступность = ОтменитьПроверкуДоступность;
	
КонецПроцедуры
&НаСервере
Процедура ОтборОперацияТипОбработкаВыбораСервер(АдресХозяйственныхОперацийИДокументов)
	
	ТЗХозОперацииИТипыДокументов = ПолучитьИзВременногоХранилища(АдресХозяйственныхОперацийИДокументов);
	ХозяйственныеОперацииИДокументы.Загрузить(ТЗХозОперацииИТипыДокументов);
	
	ТЗТипыДокументов = ТЗХозОперацииИТипыДокументов.Скопировать(Новый Структура("Отбор", Истина), "ТипДокумента");
	ТЗТипыДокументов.Свернуть("ТипДокумента");
	
	ОтборТипыДокументов.ЗагрузитьЗначения(ТЗТипыДокументов.ВыгрузитьКолонку("ТипДокумента"));
	
	НастроитьФормуПоВыбраннымОперациямИДокументам(ТЗХозОперацииИТипыДокументов);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВыбраннымОперациямИДокументам(ТЗХозОперацииИТипыДокументов)
	
	ДанныеРабочегоМеста = ОбщегоНазначенияУТ.ДанныеРабочегоМеста(ТЗХозОперацииИТипыДокументов,
		КлючНазначенияФормыПоУмолчанию(), НСтр("ru = 'Журнал проверяемых документов'"));
	
	Заголовок   = ДанныеРабочегоМеста.ЗаголовокРабочегоМеста;
	ТекущийКлюч = ДанныеРабочегоМеста.КлючНазначенияИспользования;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"ТипДокумента",
		ОтборТипыДокументов,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		Истина);
	
	ИнформационнаяНадписьОтбор = "";
	
	Если ТЗХозОперацииИТипыДокументов.Количество() = 0 Тогда
		
		ИнформационнаяНадписьОтбор = СтроковыеФункции.ФорматированнаяСтрока(
											НСтр("ru = 'Нет документов для отображения в журнале <a href=""%1"">Обновить</a>'"),
											"ОбновитьОтбор");
	Иначе
		
		ЕстьОтборы = ХозяйственныеОперацииИДокументы.НайтиСтроки(Новый Структура("Отбор",Ложь)).Количество() > 0;
		Если ЕстьОтборы Тогда
			
			КоличествоТипыДокументов = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru = ';%1 документ;;%1 документа;%1 документов;%1 документа'"), ОтборТипыДокументов.Количество());
			
			ИнформационнаяНадписьОтбор = СтроковыеФункции.ФорматированнаяСтрока(
												НСтр("ru = 'Показаны %1 <a href=""%2"">Настроить</a>'"),
												КоличествоТипыДокументов, "НастроитьОтбор");
			
		Иначе
			
			ИнформационнаяНадписьОтбор = СтроковыеФункции.ФорматированнаяСтрока(
											НСтр("ru = 'Показаны все документы журнала <a href=""%1"">Настроить</a>'"),
											"НастроитьОтбор");
			
		КонецЕсли;
	
	КонецЕсли;
	
	Элементы.ИнформационнаяНадписьОтбор.Заголовок = ИнформационнаяНадписьОтбор;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеХозяйственныеОперацииИДокументы()
	Возврат ПоместитьВоВременноеХранилище(ХозяйственныеОперацииИДокументы.Выгрузить(), УникальныйИдентификатор);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючНазначенияФормыПоУмолчанию()
	
	Возврат "ЖурналПроверяемыхДокументов";
	
КонецФункции

&НаСервере
Процедура ОбновитьОтборПоТипуДокумента()
	
	ОтборТипыДокументов.Очистить();
	МассивИменДокументов = Новый Массив;
	Для каждого ТипДокумента Из Метаданные.РегистрыСведений.СтатусыПроверкиДокументов.Измерения.Документ.Тип.Типы() Цикл
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДокумента);
		Если НЕ ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектМетаданных) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ХозяйственныеОперацииИДокументы.Добавить();
		НоваяСтрока.ПолноеИмяДокумента = ОбъектМетаданных.ПолноеИмя();
		НоваяСтрока.Отбор = Истина;
		НоваяСтрока.ТипДокумента = Тип("ДокументСсылка." + ОбъектМетаданных.Имя);
		НоваяСтрока.ДокументПредставление = ОбъектМетаданных.Синоним;
		
		ОтборТипыДокументов.Добавить(НоваяСтрока.ТипДокумента);
		МассивИменДокументов.Добавить(НоваяСтрока.ПолноеИмяДокумента);
	КонецЦикла;
	
	ИдентификаторыОбъектовМетаданных = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(МассивИменДокументов);
	Для каждого СтрокаТаблицы Из ХозяйственныеОперацииИДокументы Цикл
		СтрокаТаблицы.ИдентификаторОбъектаМетаданных = ИдентификаторыОбъектовМетаданных[СтрокаТаблицы.ПолноеИмяДокумента];
	КонецЦикла;
	
	НастроитьФормуПоВыбраннымОперациямИДокументам(ХозяйственныеОперацииИДокументы.Выгрузить());
	
КонецПроцедуры

#КонецОбласти
